[Killed] BlockStatement
Study/mutants/src/calculator.ts:1:53
-export function add(n1: number, n2: number): number {
-  return n1 + n2;
-}
+export function add(n1: number, n2: number): number {}
 
 export function sub(n1: number, n2: number): number {
killedBy: add should return 15 for add(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: undefined

[Killed] ArithmeticOperator
Study/mutants/src/calculator.ts:2:10
 export function add(n1: number, n2: number): number {
-  return n1 + n2;
+  return n1 - n2;
 }
 
killedBy: add should return 15 for add(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 5

[Killed] BlockStatement
Study/mutants/src/calculator.ts:5:53
   return n1 + n2;
 }
 
-export function sub(n1: number, n2: number): number {
-  return n1 - n2;
-}
+export function sub(n1: number, n2: number): number {}
 
 export function multiply(n1: number, n2: number): number {
killedBy: sub should return 5 for sub(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
Study/mutants/src/calculator.ts:6:10
 }
 
 export function sub(n1: number, n2: number): number {
-  return n1 - n2;
+  return n1 + n2;
 }
 
killedBy: sub should return 5 for sub(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 15

[Killed] BlockStatement
Study/mutants/src/calculator.ts:9:58
   return n1 - n2;
 }
 
-export function multiply(n1: number, n2: number): number {
-  return n1 * n2;
-}
+export function multiply(n1: number, n2: number): number {}
 
 export function divide(n1: number, n2: number): number {
killedBy: multiply should return 50 for multiply(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: undefined

[Killed] ArithmeticOperator
Study/mutants/src/calculator.ts:10:10
 }
 
 export function multiply(n1: number, n2: number): number {
-  return n1 * n2;
+  return n1 / n2;
 }
 
killedBy: multiply should return 50 for multiply(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 2

[Killed] BlockStatement
Study/mutants/src/calculator.ts:13:56
   return n1 * n2;
 }
 
-export function divide(n1: number, n2: number): number {
-  return n1 / n2;
-}
+export function divide(n1: number, n2: number): number {}
 
killedBy: divide should return 2 for divide(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
Study/mutants/src/calculator.ts:14:10
 }
 
 export function divide(n1: number, n2: number): number {
-  return n1 / n2;
+  return n1 * n2;
 }
 
killedBy: divide should return 2 for divide(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 50
