[Killed] BlockStatement
Study/mutants/src/helper.ts:1:62
-export function isGreaterThan(x: number, y: number): boolean {
-  return x > y;
-}
+export function isGreaterThan(x: number, y: number): boolean {}
 
 export function isLowerThan(x: number, y: number): boolean {
killedBy: isGreaterThan should return true for isGreaterThan(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
Study/mutants/src/helper.ts:2:10
 export function isGreaterThan(x: number, y: number): boolean {
-  return x > y;
+  return false;
 }
 
killedBy: isGreaterThan should return true for isGreaterThan(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
Study/mutants/src/helper.ts:2:10
 export function isGreaterThan(x: number, y: number): boolean {
-  return x > y;
+  return x <= y;
 }
 
killedBy: isGreaterThan should return true for isGreaterThan(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
Study/mutants/src/helper.ts:5:60
   return x > y;
 }
 
-export function isLowerThan(x: number, y: number): boolean {
-  return x < y;
-}
+export function isLowerThan(x: number, y: number): boolean {}
killedBy: isLowerThan should return false for isLowerThan(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
Study/mutants/src/helper.ts:6:10
 }
 
 export function isLowerThan(x: number, y: number): boolean {
-  return x < y;
+  return x >= y;
 }
killedBy: isLowerThan should return false for isLowerThan(10,5)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
Study/mutants/src/helper.ts:6:10
 }
 
 export function isLowerThan(x: number, y: number): boolean {
-  return x < y;
+  return false;
 }
killedBy: isLowerThan should return true for isLowerThan(2,3)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
