[Killed] BlockStatement
Study/mutants/src/order.ts:11:32
 export class OrderService {
   orders: Order[] = [];
 
-  addOrder(order: Order): void {
-    const hasOrder = this.hasOrder(order);
-
-    if (!hasOrder) {
-      this.orders.push(order);
-      return;
-    }
-
-    throw new Error('order already exists');
-  }
+  addOrder(order: Order): void {}
 
   removeOrder(order: Order): void {
killedBy: Order addOrder should add order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
Study/mutants/src/order.ts:14:20
   addOrder(order: Order): void {
     const hasOrder = this.hasOrder(order);
 
-    if (!hasOrder) {
-      this.orders.push(order);
-      return;
-    }
+    if (!hasOrder) {}
 
     throw new Error('order already exists');
killedBy: Order addOrder should add order successfully
statusReason: Error: order already exists

[Killed] ConditionalExpression
Study/mutants/src/order.ts:14:9
   addOrder(order: Order): void {
     const hasOrder = this.hasOrder(order);
 
-    if (!hasOrder) {
+    if (false) {
       this.orders.push(order);
       return;
killedBy: Order addOrder should add order successfully
statusReason: Error: order already exists

[Killed] BlockStatement
Study/mutants/src/order.ts:22:35
     throw new Error('order already exists');
   }
 
-  removeOrder(order: Order): void {
-    const orderIndex = this.findOrderIndex(order);
-
-    if (orderIndex >= 0) {
-      this.orders.splice(orderIndex, 1);
-      return;
-    }
-
-    throw new Error('order not found');
-  }
+  removeOrder(order: Order): void {}
 
   getTotalAmount(): number {
killedBy: Order removeOrder should remove order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
Study/mutants/src/order.ts:25:9
   removeOrder(order: Order): void {
     const orderIndex = this.findOrderIndex(order);
 
-    if (orderIndex >= 0) {
+    if (orderIndex < 0) {
       this.orders.splice(orderIndex, 1);
       return;
killedBy: Order removeOrder should remove order successfully
statusReason: Error: order not found

[Killed] BlockStatement
Study/mutants/src/order.ts:25:26
   removeOrder(order: Order): void {
     const orderIndex = this.findOrderIndex(order);
 
-    if (orderIndex >= 0) {
-      this.orders.splice(orderIndex, 1);
-      return;
-    }
+    if (orderIndex >= 0) {}
 
     throw new Error('order not found');
killedBy: Order removeOrder should remove order successfully
statusReason: Error: order not found

[Survived] StringLiteral
Study/mutants/src/order.ts:30:21
       return;
     }
 
-    throw new Error('order not found');
+    throw new Error("");
   }
 

[Killed] BlockStatement
Study/mutants/src/order.ts:33:28
     throw new Error('order not found');
   }
 
-  getTotalAmount(): number {
-    return this.orders.reduce((amount: number, order: Order) => {
-      return amount + order.value * order.amount;
-    }, 0);
-  }
+  getTotalAmount(): number {}
 
   private findOrderIndex(order: Order): number {
killedBy: Order getTotalAmount should calculate order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7000
Received: undefined

[Killed] BlockStatement
Study/mutants/src/order.ts:34:65
   }
 
   getTotalAmount(): number {
-    return this.orders.reduce((amount: number, order: Order) => {
-      return amount + order.value * order.amount;
-    }, 0);
+    return this.orders.reduce((amount: number, order: Order) => {}, 0);
   }
 
killedBy: Order getTotalAmount should calculate order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7000
Received: undefined

[Killed] ArithmeticOperator
Study/mutants/src/order.ts:35:14
 
   getTotalAmount(): number {
     return this.orders.reduce((amount: number, order: Order) => {
-      return amount + order.value * order.amount;
+      return amount - order.value * order.amount;
     }, 0);
   }
killedBy: Order getTotalAmount should calculate order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7000
Received: -7000

[Killed] ArithmeticOperator
Study/mutants/src/order.ts:35:23
 
   getTotalAmount(): number {
     return this.orders.reduce((amount: number, order: Order) => {
-      return amount + order.value * order.amount;
+      return amount + order.value / order.amount;
     }, 0);
   }
killedBy: Order getTotalAmount should calculate order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7000
Received: 2500

[Killed] BlockStatement
Study/mutants/src/order.ts:39:48
     }, 0);
   }
 
-  private findOrderIndex(order: Order): number {
-    return this.orders.findIndex((value: Order) => order.id === value.id);
-  }
+  private findOrderIndex(order: Order): number {}
 
   private hasOrder(order: Order): boolean {
killedBy: Order addOrder should add order successfully
statusReason: Error: order already exists

[Killed] ArrowFunction
Study/mutants/src/order.ts:40:34
   }
 
   private findOrderIndex(order: Order): number {
-    return this.orders.findIndex((value: Order) => order.id === value.id);
+    return this.orders.findIndex(() => undefined);
   }
 
killedBy: Order removeOrder should remove order successfully
statusReason: Error: order not found

[Killed] ConditionalExpression
Study/mutants/src/order.ts:40:52
   }
 
   private findOrderIndex(order: Order): number {
-    return this.orders.findIndex((value: Order) => order.id === value.id);
+    return this.orders.findIndex((value: Order) => false);
   }
 
killedBy: Order removeOrder should remove order successfully
statusReason: Error: order not found

[Survived] BlockStatement
Study/mutants/src/order.ts:43:43
     return this.orders.findIndex((value: Order) => order.id === value.id);
   }
 
-  private hasOrder(order: Order): boolean {
-    return this.findOrderIndex(order) !== -1;
-  }
+  private hasOrder(order: Order): boolean {}
 }

[Killed] ConditionalExpression
Study/mutants/src/order.ts:44:12
   }
 
   private hasOrder(order: Order): boolean {
-    return this.findOrderIndex(order) !== -1;
+    return true;
   }
 }
killedBy: Order addOrder should add order successfully
statusReason: Error: order already exists

[Killed] UnaryOperator
Study/mutants/src/order.ts:44:43
   }
 
   private hasOrder(order: Order): boolean {
-    return this.findOrderIndex(order) !== -1;
+    return this.findOrderIndex(order) !== +1;
   }
 }
killedBy: Order addOrder should add order successfully
statusReason: Error: order already exists
